app/controllers/comments_controller.rb

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("body", "recipe_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "This is the first comment.wwfwfwf"], ["recipe_id", 1], ["user_id", 1], ["created_at", "2017-07-06 20:09:57.942656"], ["updated_at", "2017-07-06 20:09:57.942656"]]
---
  def create
    @recipe = Recipe.find(params[:recipe_id])
    comment = @recipe.comments.new(comment_params)
    comment.user = current_user

    if comment.save