app/controllers/pantries_controller.rb

SELECT "pantries".* FROM "pantries" WHERE "pantries"."user_id" = ?  [["user_id", 1]]
---
  def index
    if user_signed_in?
      @pantries = Pantry.where(:user_id => current_user.id)

SELECT  "pantries".* FROM "pantries" WHERE "pantries"."id" = ? LIMIT 1  [["id", 2]]
---
  def show
    @pantry = Pantry.find(params[:id])

SELECT  "pantries".* FROM "pantries" WHERE "pantries"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @pantry = Pantry.find(params[:id])

INSERT INTO "pantries" ("ingredient", "description", "quantity", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["ingredient", "Vegetable Oil"], ["description", "Cups"], ["quantity", 6], ["user_id", 1], ["created_at", "2017-06-27 03:17:49.719100"], ["updated_at", "2017-06-27 03:17:49.719100"]]
---
  def create
    @pantry = current_user.pantries.build(pantry_params)
    if @pantry.save

SELECT  "pantries".* FROM "pantries" WHERE "pantries"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "pantries" SET "ingredient" = ?, "updated_at" = ? WHERE "pantries"."id" = ?  [["ingredient", "Sugar"], ["updated_at", "2017-06-29 22:32:05.370843"], ["id", 11]]
---
  def update
    @pantry = Pantry.find(params[:id])
    @pantry.ingredient = params[:pantry][:ingredient]
    @pantry.description = params[:pantry][:description]
    @pantry.quantity = params[:pantry][:quantity]

    if @pantry.save

SELECT  "pantries".* FROM "pantries" WHERE "pantries"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "pantries" WHERE "pantries"."id" = ?  [["id", 2]]
---
  def destroy
    @pantry = Pantry.find(params[:id])

    if @pantry.destroy