app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes" WHERE (title LIKE '%milk%') AND (ingredients LIKE '%milk%')
---
  def index
    @recipes = Recipe.all

INSERT INTO "recipes" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "wwfwfwfw"], ["body", "fawfafaf"], ["created_at", "2017-05-30 00:28:08.388166"], ["updated_at", "2017-05-30 00:28:08.388166"]]
---
  def create
    @recipe = Recipe.new
    @recipe.title = params[:recipe][:title]
    @recipe.body = params[:recipe][:body]

    if @recipe.save

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "recipes" SET "body" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["body", "1/4 gallons"], ["updated_at", "2017-05-30 00:41:37.430413"], ["id", 1]]
---
  def update
    @recipe = Recipe.find(params[:id])
    @recipe.title = params[:recipe][:title]
    @recipe.body = params[:recipe][:body]

    if @recipe.save

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = ?  [["id", 1]]
---
  def destroy
    @recipe = Recipe.find(params[:id])

    if @recipe.destroy